{
    "content": "<p>&nbsp;</p>\n\n<p><br />\n另外呢，有吧友问到，部分数据比如[static data]里的数据让人毫无头绪，要怎么找出它们对应技能的什么属性？这里就简单提一提找出对应属性（以下简称&ldquo;翻译&rdquo;）的思路，具体的还是要自己试一试才知道怎么回事啦<br />\n关于这些数据的特点，有一些是需要大家了解的。</p>\n\n<p>第一，一个技能中可改变的参数是多种多样的。像攻击力、攻击范围等是最众所周知的。除此之外，还有对目标造成的硬直、自身施放产生的僵直等，<br />\n这些是比较容易被忽略的。但是，并不是每个技能的skl文件里都包含所有的这些数据，或者说，通过修改pvf不能达到任意改变技能所有参数的目的，</p>\n\n<p>因为有些参数不包含在skl文件里。比如毛雷，有控制各种施放僵直的数据；而有的技能有着很明显的僵直却没有控制它们的数据，比如多爆（那两个不确定的数据都和自身僵直无关_(:3」&ang;)_）。<br />\n对于这种情况，只能先排除掉不太可能的，然后通过修改数据观察技能变化，进而得出结论。</p>\n\n<p>第二，数据大部分都是有单位的。比如控制僵直、延时等时间类参数的数据单位是毫秒；控制距离的数据单位是px，即像素；控制几率的数据单位是%或&permil;，等等。</p>\n\n<p>第三，技能的部分控制方式或许和我们想象的不同。比如鹰枪，我原来以为控制它&rdquo;往前飞出多远&ldquo;和&rdquo;按住方向键往旁边扔会偏多少&rdquo;的参数分别是&ldquo;飞出距离&rdquo;<br />\n和&ldquo;Y轴偏移量&rdquo;，结果测试得到的结果完全出乎意料，是&ldquo;飞行速度、飞行时间&rdquo;和&ldquo;偏移角度&rdquo;。</p>\n\n<p>第四，看起来单独存在的参数，可能实际存在的是多个参数。比如多爆的攻击次数，由5个数据对应5种武器的攻击次数，而不是单独的一个。</p>\n\n<p>第五，编写pvf的程序员也是人，他们不会给自己增加不必要的麻烦。所以那些用途相似的数据会放在一起，比如多爆控制5种武器对应发射次数的5个数据是在一起的，<br />\n而不是隔着几个其他数据出现的。对于类似鹰枪这种由多个相似部分组成的技能，找到了对应控制某一个部分某一参数的数据，和这个数据相邻的一定是控制另一个部分同一参数的数据。</p>\n\n<p><br />\n接下来就是分析方法了。skl翻译的主要工作其实就是推测。当你能有效排除其他的干扰因素，把可能性限制在一个较小的范围里，那么通过较少的测试就可以得到想要的结果。<br />\n同样的，如果你无法排除足够的干扰因素，但由于数据比较特殊或其他原因，同样可以限制它的可能性，收到一样的效果。</p>\n\n<p>第一，通过已知数据排除未知数据不可能的含义。先对照游戏中技能属性，把能够确定含义的数据找出来，自然就可以排除掉一部分的可能。试想一下，<br />\n假如已知&ldquo;100&rdquo;是控制y轴偏移量的数据，那么就不会再有其他控制y轴偏移量的数据了。（乱射这个技能是个例外&hellip;&hellip;我还没有弄清它的攻击范围的控制机理但是这类技能应该不会太多）</p>\n\n<p>第二，通过经验排除数据不可能的含义和推测可能的含义。比如毛雷，里面的5和装填数一致，而且没有其他数据是5，那么不出意外的话这个5就是装填数。然后是22219，<br />\n这个数非常大，而且不是整数，所以不应该是某项具体数值，而可能是某个ID。通过对照电雷、冰雷，发现它们相同位置的数据分别是22220和22221，猜想它们可能是代表攻击属性的。<br />\n修改并测试，得到意外收获，它们不仅控制攻击属性，而且还控制扔出去的是哪个雷。</p>\n\n<p>第三，通过测量推测数据可能的含义。比如放一个技能，测得这个技能的攻击范围是600，那么如果有600这个数据，可能就是控制攻击范围的。但这里不太推荐用测量工具进行手工测量，<br />\n因为利用工具测量同样存在各种误差，虽然测量工具提高了测量的精确度，但这种提升的意义不大，而且影响效率。所以，大概目测就行，不用非得拿个尺子或者秒表来测（我才不是说我自己）。<br />\n写的有点乱，有一些地方不知道怎么表达&hellip;&hellip;大家将就着看吧。要说这个看脸其实也有道理，比如&ldquo;我觉得这个数据是控制XXX的&rdquo;，一试果然如此，这样的情况也不是很罕见的_(:3」&ang;)_<br />\n最后祝你，研（身）究（体）顺（健）利（康），再见~</p>",
    "auth_users": "学院搬运工",
    "img": "https://dafstatic.oss-cn-beijing.aliyuncs.com/static/title/level4.gif",
    "create_at": "2023-05-07T20:25:33.458",
    "view_num": 102
}